import styles from './index.less';
import MapChart from "./map-chart";
import { useEffect,useState } from "react";
export default function IndexPage() {


  const moveLines = [
    {
      toName: '西安',
      fromName: '宁波市',
      coords: [
        [121.550357, 29.874556],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [108.940174, 34.341568],
      ],
    },
    {
      toName: '西安',
      fromName: '渭南市',
      coords: [
        [109.509786, 34.499995],
        [108.969, 34.285],
      ],
    },
    {
      toName: '台州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [121.420757, 28.656386],
      ],
    },
    {
      toName: '白城市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [122.839024, 45.619641],
      ],
    },
    {
      toName: '聊城市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [115.985371, 36.456703],
      ],
    },
    {
      toName: '西安',
      fromName: '宁波市江北区',
      coords: [
        [121.555227, 29.886757],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '玉溪市',
      coords: [
        [102.546543, 24.352036],
        [125.016, 46.593],
      ],
    },
    {
      toName: '贵阳市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [106.630153, 26.647661],
      ],
    },
    {
      toName: '西安',
      fromName: '无锡市',
      coords: [
        [120.31191, 31.491169],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '库尔勒市',
      coords: [
        [86.174633, 41.725892],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '西宁市',
      coords: [
        [101.778228, 36.617144],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '任丘市',
      coords: [
        [116.082918, 38.683592],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '北海市',
      coords: [
        [109.119927, 21.481254],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '乌兰察布市',
      coords: [
        [113.132585, 40.994785],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '果洛藏族自治州',
      coords: [
        [100.244808, 34.471431],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '哈密市',
      coords: [
        [93.514916, 42.818501],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '镇江市',
      coords: [
        [119.425836, 32.187849],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '邢台市',
      coords: [
        [114.504844, 37.070589],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '安阳市',
      coords: [
        [114.392392, 36.097577],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '河西区',
      coords: [
        [117.223372, 39.109563],
        [116.408, 39.904],
      ],
    },
    {
      toName: '宿州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.964356, 33.646373],
      ],
    },
    {
      toName: '大庆',
      fromName: '佳木斯市',
      coords: [
        [130.318917, 46.799922],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '伊犁哈萨克自治州',
      coords: [
        [81.324136, 43.916823],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '葫芦岛市',
      coords: [
        [120.836932, 40.711052],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '奉贤区',
      coords: [
        [121.474042, 30.917795],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '苏州市',
      coords: [
        [120.585315, 31.298886],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '郑州市',
      coords: [
        [113.625368, 34.746599],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吕梁市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [111.144319, 37.518314],
      ],
    },
    {
      toName: '大连市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [121.614682, 38.914003],
      ],
    },
    {
      toName: '西安',
      fromName: '通辽市',
      coords: [
        [122.243444, 43.65289],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '克拉玛依市',
      coords: [
        [84.889207, 45.579888],
        [108.969, 34.285],
      ],
    },
    {
      toName: '广元市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [105.843357, 32.435435],
      ],
    },
    {
      toName: '总部',
      fromName: '包头市',
      coords: [
        [109.840347, 40.657449],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '连云港市',
      coords: [
        [119.221611, 34.596653],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '咸阳市',
      coords: [
        [108.708991, 34.329605],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '绵阳市',
      coords: [
        [104.679114, 31.46745],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '淮安市',
      coords: [
        [119.015285, 33.610353],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '济南市',
      coords: [
        [117.119999, 36.651216],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '阳江市',
      coords: [
        [111.982232, 21.857958],
        [108.969, 34.285],
      ],
    },
    {
      toName: '湖州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.086823, 30.894348],
      ],
    },
    {
      toName: '吉林',
      fromName: '涪陵区',
      coords: [
        [107.389298, 29.703113],
        [125.324, 43.871],
      ],
    },
    {
      toName: '池州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [117.491568, 30.6648],
      ],
    },
    {
      toName: '沈阳',
      fromName: '日照市',
      coords: [
        [119.526888, 35.416377],
        [123.418, 41.799],
      ],
    },
    {
      toName: '伊春市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [128.841147, 47.727536],
      ],
    },
    {
      toName: '西安',
      fromName: '合肥市',
      coords: [
        [117.227239, 31.820586],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '武汉市',
      coords: [
        [114.305392, 30.593098],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '廊坊市',
      coords: [
        [116.683752, 39.538047],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '海西蒙古族藏族自治州',
      coords: [
        [97.369751, 37.377139],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '六安市',
      coords: [
        [116.521854, 31.733699],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '松原市',
      coords: [
        [124.825117, 45.141789],
        [125.324, 43.871],
      ],
    },
    {
      toName: '武汉市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.305392, 30.593098],
      ],
    },
    {
      toName: '总部',
      fromName: '平顶山市',
      coords: [
        [113.192661, 33.766169],
        [116.408, 39.904],
      ],
    },
    {
      toName: '海淀区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.329519, 39.972134],
      ],
    },
    {
      toName: '总部',
      fromName: '荆门市',
      coords: [
        [112.199265, 31.035423],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '鸡西市',
      coords: [
        [130.969333, 45.295075],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '开封市',
      coords: [
        [114.307581, 34.797239],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '常州市',
      coords: [
        [119.973987, 31.810689],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '杭州市',
      coords: [
        [120.15507, 30.274084],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '嘉峪关市',
      coords: [
        [98.289152, 39.77313],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '汕尾市',
      coords: [
        [115.375278, 22.786211],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '济宁市',
      coords: [
        [116.587098, 35.414921],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西宁市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [101.778228, 36.617144],
      ],
    },
    {
      toName: '南宁市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [108.366543, 22.817002],
      ],
    },
    {
      toName: '张掖市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [100.449818, 38.925875],
      ],
    },
    {
      toName: '宝鸡市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [107.237974, 34.361979],
      ],
    },
    {
      toName: '沈阳',
      fromName: '浦东新区',
      coords: [
        [121.544379, 31.221517],
        [123.418, 41.799],
      ],
    },
    {
      toName: '佛山市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.121416, 23.021548],
      ],
    },
    {
      toName: '上饶市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [117.943433, 28.454863],
      ],
    },
    {
      toName: '大庆',
      fromName: '贺州市',
      coords: [
        [111.566694, 24.403582],
        [125.016, 46.593],
      ],
    },
    {
      toName: '东城区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.416357, 39.928353],
      ],
    },
    {
      toName: '西安',
      fromName: '亳州市',
      coords: [
        [115.778676, 33.844582],
        [108.969, 34.285],
      ],
    },
    {
      toName: '南昌市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [115.858197, 28.682892],
      ],
    },
    {
      toName: '吉林',
      fromName: '乐山市',
      coords: [
        [103.765568, 29.552106],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '南昌市',
      coords: [
        [115.858197, 28.682892],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '漯河市',
      coords: [
        [114.016539, 33.581412],
        [116.408, 39.904],
      ],
    },
    {
      toName: '十堰市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [110.79799, 32.629397],
      ],
    },
    {
      toName: '吉林',
      fromName: '宜宾市',
      coords: [
        [104.643215, 28.751768],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '淮南市',
      coords: [
        [116.999932, 32.625478],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '喀什市',
      coords: [
        [75.989755, 39.4704],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '海南区',
      coords: [
        [106.891424, 39.441364],
        [116.408, 39.904],
      ],
    },
    {
      toName: '阿勒泰市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [88.131842, 47.827309],
      ],
    },
    {
      toName: '哈尔滨市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [126.534967, 45.803775],
      ],
    },
    {
      toName: '忻州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.734174, 38.416663],
      ],
    },
    {
      toName: '西安',
      fromName: '茂名市',
      coords: [
        [110.925456, 21.662999],
        [108.969, 34.285],
      ],
    },
    {
      toName: '青浦区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [121.124178, 31.150681],
      ],
    },
    {
      toName: '驻马店市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [114.022298, 33.011529],
      ],
    },
    {
      toName: '西安',
      fromName: '襄阳市',
      coords: [
        [112.122414, 32.008986],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '呼伦贝尔市',
      coords: [
        [119.765744, 49.211574],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '泸州市',
      coords: [
        [105.442258, 28.871811],
        [116.408, 39.904],
      ],
    },
    {
      toName: '石家庄市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.514859, 38.042306],
      ],
    },
    {
      toName: '杭州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.15507, 30.274084],
      ],
    },
    {
      toName: '西安',
      fromName: '郴州市',
      coords: [
        [113.014717, 25.770509],
        [108.969, 34.285],
      ],
    },
    {
      toName: '烟台市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [121.447935, 37.463822],
      ],
    },
    {
      toName: '大庆',
      fromName: '黑河市',
      coords: [
        [127.52856, 50.245329],
        [125.016, 46.593],
      ],
    },
    {
      toName: '沈阳',
      fromName: '滨州市',
      coords: [
        [117.970703, 37.38199],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '十堰市',
      coords: [
        [110.79799, 32.629397],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '本溪市',
      coords: [
        [123.766485, 41.294175],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '邵阳市',
      coords: [
        [111.467791, 27.238892],
        [108.969, 34.285],
      ],
    },
    {
      toName: '伊犁哈萨克自治州',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [81.324136, 43.916823],
      ],
    },
    {
      toName: '桂林市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [110.290194, 25.273566],
      ],
    },
    {
      toName: '总部',
      fromName: '大连市',
      coords: [
        [121.614682, 38.914003],
        [116.408, 39.904],
      ],
    },
    {
      toName: '德阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [104.397894, 31.126855],
      ],
    },
    {
      toName: '西安',
      fromName: '沙坪坝区',
      coords: [
        [106.456878, 29.541145],
        [108.969, 34.285],
      ],
    },
    {
      toName: '连云港市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.221611, 34.596653],
      ],
    },
    {
      toName: '大庆',
      fromName: '楚雄市',
      coords: [
        [101.528068, 25.045532],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '广元市',
      coords: [
        [105.843357, 32.435435],
        [125.324, 43.871],
      ],
    },
    {
      toName: '驻马店市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.022298, 33.011529],
      ],
    },
    {
      toName: '西安',
      fromName: '仙桃市',
      coords: [
        [113.453974, 30.364953],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '百色市',
      coords: [
        [106.618201, 23.902333],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '新乡市',
      coords: [
        [113.9268, 35.303004],
        [116.408, 39.904],
      ],
    },
    {
      toName: '廊坊市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.683752, 39.538047],
      ],
    },
    {
      toName: '汕尾市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [115.375278, 22.786211],
      ],
    },
    {
      toName: '总部',
      fromName: '北京市朝阳区',
      coords: [
        [116.601144, 39.948574],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '长宁区',
      coords: [
        [121.424624, 31.220367],
        [123.418, 41.799],
      ],
    },
    {
      toName: '吉林',
      fromName: '甘孜藏族自治州',
      coords: [
        [101.96231, 30.04952],
        [125.324, 43.871],
      ],
    },
    {
      toName: '沈阳',
      fromName: '烟台市',
      coords: [
        [121.447935, 37.463822],
        [123.418, 41.799],
      ],
    },
    {
      toName: '昆山市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.980737, 31.385598],
      ],
    },
    {
      toName: '西安',
      fromName: '武威市',
      coords: [
        [102.638011, 37.928264],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '聊城市',
      coords: [
        [115.985371, 36.456703],
        [116.408, 39.904],
      ],
    },
    {
      toName: '丽水市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.922796, 28.46763],
      ],
    },
    {
      toName: '沈阳',
      fromName: '菏泽市',
      coords: [
        [115.480656, 35.23375],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '庆阳市',
      coords: [
        [107.643631, 35.709077],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '黄石市',
      coords: [
        [115.03852, 30.199652],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '甘南县',
      coords: [
        [123.507429, 47.922406],
        [108.969, 34.285],
      ],
    },
    {
      toName: '密云区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.843177, 40.376834],
      ],
    },
    {
      toName: '宝鸡市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [107.237974, 34.361979],
      ],
    },
    {
      toName: '吉林',
      fromName: '雅安市',
      coords: [
        [103.013261, 29.980537],
        [125.324, 43.871],
      ],
    },
    {
      toName: '绵阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [104.679114, 31.46745],
      ],
    },
    {
      toName: '沈阳',
      fromName: '银川市',
      coords: [
        [106.230909, 38.487193],
        [123.418, 41.799],
      ],
    },
    {
      toName: '吉林',
      fromName: '辽源市',
      coords: [
        [125.143532, 42.887918],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '阿勒泰市',
      coords: [
        [88.131842, 47.827309],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '德阳市',
      coords: [
        [104.397894, 31.126855],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '郑州市',
      coords: [
        [113.625368, 34.746599],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '南岸区',
      coords: [
        [106.644428, 29.500297],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '长沙市',
      coords: [
        [112.938814, 28.228209],
        [108.969, 34.285],
      ],
    },
    {
      toName: '通化市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [125.939697, 41.728401],
      ],
    },
    {
      toName: '总部',
      fromName: '锡林郭勒盟',
      coords: [
        [116.048222, 43.933454],
        [116.408, 39.904],
      ],
    },
    {
      toName: '包头市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [109.840347, 40.657449],
      ],
    },
    {
      toName: '西安',
      fromName: '鄂尔多斯市',
      coords: [
        [109.781327, 39.608266],
        [108.969, 34.285],
      ],
    },
    {
      toName: '湖州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.086823, 30.894348],
      ],
    },
    {
      toName: '城口县',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [108.664214, 31.947633],
      ],
    },
    {
      toName: '总部',
      fromName: '太原市',
      coords: [
        [112.548879, 37.87059],
        [116.408, 39.904],
      ],
    },
    {
      toName: '武汉市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [114.305392, 30.593098],
      ],
    },
    {
      toName: '惠州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [114.416196, 23.111847],
      ],
    },
    {
      toName: '贵阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [106.630153, 26.647661],
      ],
    },
    {
      toName: '西安',
      fromName: '贵阳市',
      coords: [
        [106.630153, 26.647661],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '北碚区',
      coords: [
        [106.445122, 29.822616],
        [116.408, 39.904],
      ],
    },
    {
      toName: '喀什市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [75.989755, 39.4704],
      ],
    },
    {
      toName: '西安',
      fromName: '巴彦淖尔市',
      coords: [
        [107.387657, 40.743213],
        [108.969, 34.285],
      ],
    },
    {
      toName: '太原市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.548879, 37.87059],
      ],
    },
    {
      toName: '吉林',
      fromName: '六盘水市',
      coords: [
        [104.830359, 26.592666],
        [125.324, 43.871],
      ],
    },
    {
      toName: '静海区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.97413, 38.947512],
      ],
    },
    {
      toName: '双鸭山市宝山区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [131.401589, 46.577167],
      ],
    },
    {
      toName: '唐山市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [118.180193, 39.630867],
      ],
    },
    {
      toName: '西安',
      fromName: '广州市',
      coords: [
        [113.264434, 23.129162],
        [108.969, 34.285],
      ],
    },
    {
      toName: '咸阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [108.708991, 34.329605],
      ],
    },
    {
      toName: '宁波市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [121.550357, 29.874556],
      ],
    },
    {
      toName: '吉林',
      fromName: '萍乡市',
      coords: [
        [113.854556, 27.622768],
        [125.324, 43.871],
      ],
    },
    {
      toName: '舟山市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [122.207215, 29.985295],
      ],
    },
    {
      toName: '总部',
      fromName: '阳泉市',
      coords: [
        [113.580519, 37.856971],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '吴忠市',
      coords: [
        [106.198393, 37.99746],
        [108.969, 34.285],
      ],
    },
    {
      toName: '湘潭市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.944049, 27.829738],
      ],
    },
    {
      toName: '滨州市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.970703, 37.38199],
      ],
    },
    {
      toName: '西安',
      fromName: '城口县',
      coords: [
        [108.664214, 31.947633],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '海口市',
      coords: [
        [110.198293, 20.044001],
        [125.016, 46.593],
      ],
    },
    {
      toName: '沈阳',
      fromName: '营口市',
      coords: [
        [122.235417, 40.667012],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '阿拉善盟',
      coords: [
        [105.728969, 38.851892],
        [108.969, 34.285],
      ],
    },
    {
      toName: '松原市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [124.825117, 45.141789],
      ],
    },
    {
      toName: '总部',
      fromName: '唐山市',
      coords: [
        [118.180193, 39.630867],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '曲靖市',
      coords: [
        [103.796167, 25.489999],
        [125.016, 46.593],
      ],
    },
    {
      toName: '洛阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.45404, 34.619682],
      ],
    },
    {
      toName: '盘锦市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [122.070714, 41.119997],
      ],
    },
    {
      toName: '西安',
      fromName: '平凉市',
      coords: [
        [106.66524, 35.543051],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '黔西南布依族苗族自治州',
      coords: [
        [104.906396, 25.087825],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '泸州市',
      coords: [
        [105.442258, 28.871811],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '商洛市',
      coords: [
        [109.940477, 33.870422],
        [108.969, 34.285],
      ],
    },
    {
      toName: '抚顺市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [123.957208, 41.880872],
      ],
    },
    {
      toName: '总部',
      fromName: '渝中区',
      coords: [
        [106.568892, 29.55275],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '常德市',
      coords: [
        [111.698497, 29.031673],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '宜春市',
      coords: [
        [114.416778, 27.815619],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '南宁市',
      coords: [
        [108.366543, 22.817002],
        [125.324, 43.871],
      ],
    },
    {
      toName: '北京市朝阳区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.601144, 39.948574],
      ],
    },
    {
      toName: '沈阳市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [123.431474, 41.805698],
      ],
    },
    {
      toName: '大庆',
      fromName: '大庆市',
      coords: [
        [125.103784, 46.589309],
        [125.016, 46.593],
      ],
    },
    {
      toName: '南京市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [118.796877, 32.060255],
      ],
    },
    {
      toName: '沈阳',
      fromName: '中卫市',
      coords: [
        [105.196902, 37.499972],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '吉首市',
      coords: [
        [109.926773, 28.297201],
        [108.969, 34.285],
      ],
    },
    {
      toName: '海淀区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.329519, 39.972134],
      ],
    },
    {
      toName: '吉林',
      fromName: '自贡市',
      coords: [
        [104.778442, 29.33903],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '汕头市',
      coords: [
        [116.681972, 23.354091],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '青岛市',
      coords: [
        [120.382639, 36.067082],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '南京市',
      coords: [
        [118.796877, 32.060255],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '白山市',
      coords: [
        [126.423587, 41.939994],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '遵义市',
      coords: [
        [106.927389, 27.725654],
        [125.324, 43.871],
      ],
    },
    {
      toName: '廊坊市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [116.683752, 39.538047],
      ],
    },
    {
      toName: '大庆',
      fromName: '思茅区',
      coords: [
        [100.977165, 22.78691],
        [125.016, 46.593],
      ],
    },
    {
      toName: '保山市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [99.161761, 25.112046],
      ],
    },
    {
      toName: '大庆',
      fromName: '贵港市',
      coords: [
        [109.598926, 23.11153],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '来宾市',
      coords: [
        [109.221465, 23.750306],
        [125.016, 46.593],
      ],
    },
    {
      toName: '天津市河东区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.251587, 39.128291],
      ],
    },
    {
      toName: '总部',
      fromName: '银川市',
      coords: [
        [106.230909, 38.487193],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大兴区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.341014, 39.784747],
      ],
    },
    {
      toName: '沈阳',
      fromName: '淄博市',
      coords: [
        [118.054927, 36.813487],
        [123.418, 41.799],
      ],
    },
    {
      toName: '总部',
      fromName: '忻州市',
      coords: [
        [112.734174, 38.416663],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '滨海新区',
      coords: [
        [117.78067, 39.246083],
        [123.418, 41.799],
      ],
    },
    {
      toName: '晋中市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.752694, 37.687024],
      ],
    },
    {
      toName: '太原市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.548879, 37.87059],
      ],
    },
    {
      toName: '西安',
      fromName: '酒泉市',
      coords: [
        [98.494483, 39.73241],
        [108.969, 34.285],
      ],
    },
    {
      toName: '乌兰察布市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.132585, 40.994785],
      ],
    },
    {
      toName: '延边朝鲜族自治州',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [129.508946, 42.891253],
      ],
    },
    {
      toName: '鄂尔多斯市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [109.781327, 39.608266],
      ],
    },
    {
      toName: '总部',
      fromName: '晋中市',
      coords: [
        [112.752694, 37.687024],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '绍兴市',
      coords: [
        [120.580232, 30.029752],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '顺义区',
      coords: [
        [116.654561, 40.130347],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '泰州市',
      coords: [
        [119.923116, 32.455778],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '鄂州市',
      coords: [
        [114.894843, 30.39194],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '黔东南苗族侗族自治州',
      coords: [
        [107.982859, 26.583442],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '韶关市',
      coords: [
        [113.597522, 24.810403],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '临泉县',
      coords: [
        [115.261473, 33.040261],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '北京市通州区',
      coords: [
        [116.656435, 39.909946],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '佛山市',
      coords: [
        [113.121416, 23.021548],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '南阳市',
      coords: [
        [112.528321, 32.990833],
        [116.408, 39.904],
      ],
    },
    {
      toName: '承德市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.96241, 40.954071],
      ],
    },
    {
      toName: '邵阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [111.467791, 27.238892],
      ],
    },
    {
      toName: '湛江市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [110.359377, 21.270707],
      ],
    },
    {
      toName: '六安市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [116.521854, 31.733699],
      ],
    },
    {
      toName: '大庆',
      fromName: '文山市',
      coords: [
        [104.216248, 23.400733],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '鹤岗市',
      coords: [
        [130.297964, 47.349916],
        [125.016, 46.593],
      ],
    },
    {
      toName: '中山市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.392782, 22.517645],
      ],
    },
    {
      toName: '榆林市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [109.734589, 38.28539],
      ],
    },
    {
      toName: '总部',
      fromName: '宿迁市',
      coords: [
        [118.275198, 33.963232],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '宁波市江北区',
      coords: [
        [121.555227, 29.886757],
        [125.324, 43.871],
      ],
    },
    {
      toName: '牡丹江市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [129.633168, 44.551653],
      ],
    },
    {
      toName: '西安',
      fromName: '徐州市',
      coords: [
        [117.284124, 34.205768],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '赤峰市',
      coords: [
        [118.886856, 42.257817],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '淮南市',
      coords: [
        [116.999932, 32.625478],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '毕节市',
      coords: [
        [105.283992, 27.302589],
        [125.324, 43.871],
      ],
    },
    {
      toName: '辽阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [123.236944, 41.267244],
      ],
    },
    {
      toName: '吉林',
      fromName: '白城市',
      coords: [
        [122.839024, 45.619641],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '巴中市',
      coords: [
        [106.747477, 31.867903],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '和田市',
      coords: [
        [79.913534, 37.112149],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '鹰潭市',
      coords: [
        [117.069202, 28.260189],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '新郑市',
      coords: [
        [113.740529, 34.395562],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '吉林市',
      coords: [
        [126.549576, 43.837883],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '齐齐哈尔市',
      coords: [
        [123.918186, 47.354348],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [108.940174, 34.341568],
      ],
    },
    {
      toName: '长沙市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.938814, 28.228209],
      ],
    },
    {
      toName: '沈阳',
      fromName: '丹东市',
      coords: [
        [124.354706, 40.000499],
        [123.418, 41.799],
      ],
    },
    {
      toName: '钦州市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [108.654146, 21.979933],
      ],
    },
    {
      toName: '大庆',
      fromName: '南宁市',
      coords: [
        [108.366543, 22.817002],
        [125.016, 46.593],
      ],
    },
    {
      toName: '四平市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [124.350398, 43.166419],
      ],
    },
    {
      toName: '总部',
      fromName: '阿克苏市',
      coords: [
        [80.260605, 41.168779],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '河池市',
      coords: [
        [108.085261, 24.692931],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '驻马店市',
      coords: [
        [114.022298, 33.011529],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '昆明市',
      coords: [
        [102.832891, 24.880095],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '长治市',
      coords: [
        [113.116255, 36.195386],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '宁波市',
      coords: [
        [121.550357, 29.874556],
        [123.418, 41.799],
      ],
    },
    {
      toName: '沈阳',
      fromName: '临沂市',
      coords: [
        [118.356448, 35.104672],
        [123.418, 41.799],
      ],
    },
    {
      toName: '巴音郭楞蒙古自治州',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [86.145298, 41.764115],
      ],
    },
    {
      toName: '西安',
      fromName: '黄山市',
      coords: [
        [118.337481, 29.714655],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '盘锦市',
      coords: [
        [122.070714, 41.119997],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '恩施市',
      coords: [
        [109.488172, 30.272156],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '商丘市',
      coords: [
        [115.65637, 34.414172],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '攀枝花市',
      coords: [
        [101.718637, 26.582347],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '呼和浩特市',
      coords: [
        [111.74918, 40.842585],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '宜昌市',
      coords: [
        [111.286471, 30.691967],
        [116.408, 39.904],
      ],
    },
    {
      toName: '乌鲁木齐市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [87.616848, 43.825592],
      ],
    },
    {
      toName: '浦东新区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [121.544379, 31.221517],
      ],
    },
    {
      toName: '总部',
      fromName: '乌鲁木齐市',
      coords: [
        [87.616848, 43.825592],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '朔州市',
      coords: [
        [112.432825, 39.331595],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '宝鸡市',
      coords: [
        [107.237974, 34.361979],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '马鞍山市',
      coords: [
        [118.506759, 31.670452],
        [123.418, 41.799],
      ],
    },
    {
      toName: '镇江市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [119.425836, 32.187849],
      ],
    },
    {
      toName: '长治市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.116255, 36.195386],
      ],
    },
    {
      toName: '总部',
      fromName: '静海区',
      coords: [
        [116.97413, 38.947512],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '黄冈市',
      coords: [
        [114.872316, 30.453905],
        [108.969, 34.285],
      ],
    },
    {
      toName: '韶关市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.597522, 24.810403],
      ],
    },
    {
      toName: '沈阳',
      fromName: '阜新市',
      coords: [
        [121.670323, 42.021619],
        [123.418, 41.799],
      ],
    },
    {
      toName: '总部',
      fromName: '天津市和平区',
      coords: [
        [117.208125, 39.118897],
        [116.408, 39.904],
      ],
    },
    {
      toName: '常州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.973987, 31.810689],
      ],
    },
    {
      toName: '吉林',
      fromName: '长春市',
      coords: [
        [125.323544, 43.817071],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '临汾市',
      coords: [
        [111.518976, 36.088005],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '拉萨市',
      coords: [
        [91.140856, 29.645554],
        [116.408, 39.904],
      ],
    },
    {
      toName: '南京市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.796877, 32.060255],
      ],
    },
    {
      toName: '桂林市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [110.290194, 25.273566],
      ],
    },
    {
      toName: '吉林',
      fromName: '凉山彝族自治州',
      coords: [
        [102.267335, 27.88161],
        [125.324, 43.871],
      ],
    },
    {
      toName: '南宁市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [108.366543, 22.817002],
      ],
    },
    {
      toName: '辽阳市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [123.236944, 41.267244],
      ],
    },
    {
      toName: '杭州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.15507, 30.274084],
      ],
    },
    {
      toName: '沈阳',
      fromName: '合肥市',
      coords: [
        [117.227239, 31.820586],
        [123.418, 41.799],
      ],
    },
    {
      toName: '银川市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [106.230909, 38.487193],
      ],
    },
    {
      toName: '西安',
      fromName: '乌海市',
      coords: [
        [106.794249, 39.655388],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '西青区',
      coords: [
        [117.013949, 39.141591],
        [116.408, 39.904],
      ],
    },
    {
      toName: '庆阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [107.643631, 35.709077],
      ],
    },
    {
      toName: '锦州市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [121.127003, 41.095119],
      ],
    },
    {
      toName: '西安',
      fromName: '云浮市',
      coords: [
        [112.044491, 22.915094],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '兰州市',
      coords: [
        [103.834303, 36.061089],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '柳州市',
      coords: [
        [109.415953, 24.325502],
        [125.324, 43.871],
      ],
    },
    {
      toName: '阜阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [115.814204, 32.890124],
      ],
    },
    {
      toName: '吉林',
      fromName: '新余市',
      coords: [
        [114.917346, 27.817808],
        [125.324, 43.871],
      ],
    },
    {
      toName: '迪庆藏族自治州',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [99.702234, 27.818882],
      ],
    },
    {
      toName: '合肥市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.227239, 31.820586],
      ],
    },
    {
      toName: '总部',
      fromName: '盐城市',
      coords: [
        [120.163561, 33.347382],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '塔城市',
      coords: [
        [82.978928, 46.748523],
        [116.408, 39.904],
      ],
    },
    {
      toName: '扬州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.412966, 32.39421],
      ],
    },
    {
      toName: '百色市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [106.618201, 23.902333],
      ],
    },
    {
      toName: '总部',
      fromName: '三门峡市',
      coords: [
        [111.200135, 34.772493],
        [116.408, 39.904],
      ],
    },
    {
      toName: '潍坊市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [119.161755, 36.706774],
      ],
    },
    {
      toName: '吉林',
      fromName: '渝中区',
      coords: [
        [106.568892, 29.55275],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '湘潭市',
      coords: [
        [112.944049, 27.829738],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '马鞍山市',
      coords: [
        [118.506759, 31.670452],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西城区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.365868, 39.912289],
      ],
    },
    {
      toName: '大庆',
      fromName: '桂林市',
      coords: [
        [110.290194, 25.273566],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '钦州市',
      coords: [
        [108.654146, 21.979933],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '防城港市',
      coords: [
        [108.353846, 21.68686],
        [125.016, 46.593],
      ],
    },
    {
      toName: '拉萨市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [91.140856, 29.645554],
      ],
    },
    {
      toName: '沈阳',
      fromName: '威海市',
      coords: [
        [122.120419, 37.513068],
        [123.418, 41.799],
      ],
    },
    {
      toName: '秦皇岛市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.600492, 39.935385],
      ],
    },
    {
      toName: '总部',
      fromName: '大同市',
      coords: [
        [113.300129, 40.076762],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '临夏市',
      coords: [
        [103.210538, 35.601182],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '榆林市',
      coords: [
        [109.734589, 38.28539],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '东营市',
      coords: [
        [118.674767, 37.434751],
        [123.418, 41.799],
      ],
    },
    {
      toName: '总部',
      fromName: '南通市',
      coords: [
        [120.894291, 31.980171],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '南充市',
      coords: [
        [106.110698, 30.837793],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '张家界市',
      coords: [
        [110.479191, 29.117096],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '临沧市',
      coords: [
        [100.079583, 23.877573],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '酒泉市',
      coords: [
        [98.494483, 39.73241],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '贵阳市',
      coords: [
        [106.630153, 26.647661],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '七台河市',
      coords: [
        [131.003138, 45.771726],
        [125.016, 46.593],
      ],
    },
    {
      toName: '徐汇区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [121.437866, 31.19919],
      ],
    },
    {
      toName: '酒泉市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [98.494483, 39.73241],
      ],
    },
    {
      toName: '杭州市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [120.15507, 30.274084],
      ],
    },
    {
      toName: '房山区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.143267, 39.749144],
      ],
    },
    {
      toName: '沈阳',
      fromName: '德州市',
      coords: [
        [116.357464, 37.434092],
        [123.418, 41.799],
      ],
    },
    {
      toName: '龙岩市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [117.017536, 25.075123],
      ],
    },
    {
      toName: '西安',
      fromName: '揭阳市',
      coords: [
        [116.372831, 23.549993],
        [108.969, 34.285],
      ],
    },
    {
      toName: '江门市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.081901, 22.578738],
      ],
    },
    {
      toName: '沈阳',
      fromName: '葫芦岛市',
      coords: [
        [120.836932, 40.711052],
        [123.418, 41.799],
      ],
    },
    {
      toName: '大庆',
      fromName: '迪庆藏族自治州',
      coords: [
        [99.702234, 27.818882],
        [125.016, 46.593],
      ],
    },
    {
      toName: '沈阳',
      fromName: '朝阳市',
      coords: [
        [120.450372, 41.573734],
        [123.418, 41.799],
      ],
    },
    {
      toName: '吉林',
      fromName: '蚌埠市',
      coords: [
        [117.389719, 32.916287],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吐鲁番市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [89.189651, 42.951382],
      ],
    },
    {
      toName: '黔江区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [108.770678, 29.53361],
      ],
    },
    {
      toName: '雅安市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [103.013261, 29.980537],
      ],
    },
    {
      toName: '吉林',
      fromName: '苏州市',
      coords: [
        [120.585315, 31.298886],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '张掖市',
      coords: [
        [100.449818, 38.925875],
        [116.408, 39.904],
      ],
    },
    {
      toName: '佳木斯市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [130.318917, 46.799922],
      ],
    },
    {
      toName: '万州区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [108.408661, 30.807667],
      ],
    },
    {
      toName: '西安',
      fromName: '衡阳市',
      coords: [
        [112.571997, 26.89323],
        [108.969, 34.285],
      ],
    },
    {
      toName: '镇江市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.425836, 32.187849],
      ],
    },
    {
      toName: '齐齐哈尔市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [123.918186, 47.354348],
      ],
    },
    {
      toName: '河源市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [114.700447, 23.743538],
      ],
    },
    {
      toName: '珠海市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.576726, 22.270715],
      ],
    },
    {
      toName: '乐山市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [103.765568, 29.552106],
      ],
    },
    {
      toName: '大庆',
      fromName: '赤峰市',
      coords: [
        [118.886856, 42.257817],
        [125.016, 46.593],
      ],
    },
    {
      toName: '宜春市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [114.416778, 27.815619],
      ],
    },
    {
      toName: '总部',
      fromName: '菏泽市',
      coords: [
        [115.480656, 35.23375],
        [116.408, 39.904],
      ],
    },
    {
      toName: '莱芜区',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.676723, 36.213813],
      ],
    },
    {
      toName: '总部',
      fromName: '厦门市',
      coords: [
        [118.089425, 24.479833],
        [116.408, 39.904],
      ],
    },
    {
      toName: '晋城市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.851831, 35.490701],
      ],
    },
    {
      toName: '总部',
      fromName: '保定市',
      coords: [
        [115.464806, 38.873891],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '博尔塔拉蒙古自治州',
      coords: [
        [82.066159, 44.905588],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '无锡市',
      coords: [
        [120.31191, 31.491169],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '南京市',
      coords: [
        [118.796877, 32.060255],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '肇庆市',
      coords: [
        [112.465091, 23.047191],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '景德镇市',
      coords: [
        [117.178419, 29.268835],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '九龙坡区',
      coords: [
        [106.53192, 29.51419],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '遂宁市',
      coords: [
        [105.592898, 30.532847],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '新郑市',
      coords: [
        [113.740529, 34.395562],
        [125.324, 43.871],
      ],
    },
    {
      toName: '兴庆区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.28865, 38.47361],
      ],
    },
    {
      toName: '呼和浩特市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [111.74918, 40.842585],
      ],
    },
    {
      toName: '西安',
      fromName: '巴音郭楞蒙古自治州',
      coords: [
        [86.145298, 41.764115],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '龙岩市',
      coords: [
        [117.017536, 25.075123],
        [125.016, 46.593],
      ],
    },
    {
      toName: '沈阳',
      fromName: '沈阳市',
      coords: [
        [123.431474, 41.805698],
        [123.418, 41.799],
      ],
    },
    {
      toName: '吉林',
      fromName: '玉树市',
      coords: [
        [97.008785, 32.993107],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '福州市',
      coords: [
        [119.296494, 26.074507],
        [116.408, 39.904],
      ],
    },
    {
      toName: '亳州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [115.778676, 33.844582],
      ],
    },
    {
      toName: '吉林',
      fromName: '荣昌区',
      coords: [
        [105.594623, 29.405002],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '石河子市',
      coords: [
        [86.08046, 44.305428],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '济宁市',
      coords: [
        [116.587098, 35.414921],
        [123.418, 41.799],
      ],
    },
    {
      toName: '郑州市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [113.625368, 34.746599],
      ],
    },
    {
      toName: '合肥市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.227239, 31.820586],
      ],
    },
    {
      toName: '吉林',
      fromName: '黔南布依族苗族自治州',
      coords: [
        [107.522097, 26.254092],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '扬州市',
      coords: [
        [119.412966, 32.39421],
        [108.969, 34.285],
      ],
    },
    {
      toName: '酒泉市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [98.494483, 39.73241],
      ],
    },
    {
      toName: '大庆',
      fromName: '临夏市',
      coords: [
        [103.210538, 35.601182],
        [125.016, 46.593],
      ],
    },
    {
      toName: '长寿区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [107.081283, 29.857996],
      ],
    },
    {
      toName: '总部',
      fromName: '莱芜区',
      coords: [
        [117.676723, 36.213813],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '白银市',
      coords: [
        [104.138559, 36.544756],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '衡水市',
      coords: [
        [115.670177, 37.73892],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '南平市',
      coords: [
        [118.081325, 27.382829],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉安市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [114.992509, 27.113443],
      ],
    },
    {
      toName: '西安',
      fromName: '滁州市',
      coords: [
        [118.317106, 32.301556],
        [108.969, 34.285],
      ],
    },
    {
      toName: '鄂尔多斯市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [109.781327, 39.608266],
      ],
    },
    {
      toName: '总部',
      fromName: '石家庄市',
      coords: [
        [114.514859, 38.042306],
        [116.408, 39.904],
      ],
    },
    {
      toName: '浦东新区',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [121.544379, 31.221517],
      ],
    },
    {
      toName: '总部',
      fromName: '咸宁市',
      coords: [
        [114.322492, 29.841443],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '成都市',
      coords: [
        [104.066541, 30.572269],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '上海市普陀区',
      coords: [
        [121.395555, 31.24984],
        [116.408, 39.904],
      ],
    },
    {
      toName: '南昌市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [115.858197, 28.682892],
      ],
    },
    {
      toName: '巴音郭楞蒙古自治州',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [86.145298, 41.764115],
      ],
    },
    {
      toName: '六安市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.521854, 31.733699],
      ],
    },
    {
      toName: '临汾市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [111.518976, 36.088005],
      ],
    },
    {
      toName: '沈阳',
      fromName: '抚顺市',
      coords: [
        [123.957208, 41.880872],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '东莞市',
      coords: [
        [113.751765, 23.020536],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '三明市',
      coords: [
        [117.638678, 26.263406],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '巢湖市',
      coords: [
        [117.8618, 31.598628],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '咸阳市',
      coords: [
        [108.708991, 34.329605],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '泸州市',
      coords: [
        [105.442258, 28.871811],
        [108.969, 34.285],
      ],
    },
    {
      toName: '临沂市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [118.356448, 35.104672],
      ],
    },
    {
      toName: '西安',
      fromName: '金昌市',
      coords: [
        [102.188043, 38.520089],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '桂林市',
      coords: [
        [110.290194, 25.273566],
        [125.324, 43.871],
      ],
    },
    {
      toName: '无锡市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.31191, 31.491169],
      ],
    },
    {
      toName: '西安',
      fromName: '包头市',
      coords: [
        [109.840347, 40.657449],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '九江市',
      coords: [
        [116.00193, 29.705077],
        [125.324, 43.871],
      ],
    },
    {
      toName: '重庆市江北区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.574271, 29.606703],
      ],
    },
    {
      toName: '鞍山市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [122.994329, 41.108647],
      ],
    },
    {
      toName: '连云港市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.221611, 34.596653],
      ],
    },
    {
      toName: '哈密市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [93.514916, 42.818501],
      ],
    },
    {
      toName: '总部',
      fromName: '白银市',
      coords: [
        [104.138559, 36.544756],
        [116.408, 39.904],
      ],
    },
    {
      toName: '葫芦岛市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [120.836932, 40.711052],
      ],
    },
    {
      toName: '总部',
      fromName: '鹤壁市',
      coords: [
        [114.297272, 35.747225],
        [116.408, 39.904],
      ],
    },
    {
      toName: '库尔勒市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [86.174633, 41.725892],
      ],
    },
    {
      toName: '张家界市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [110.479191, 29.117096],
      ],
    },
    {
      toName: '沈阳',
      fromName: '莱芜区',
      coords: [
        [117.676723, 36.213813],
        [123.418, 41.799],
      ],
    },
    {
      toName: '成都市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [104.066541, 30.572269],
      ],
    },
    {
      toName: '嘉定区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [121.2653, 31.375602],
      ],
    },
    {
      toName: '滨海新区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.78067, 39.246083],
      ],
    },
    {
      toName: '总部',
      fromName: '海淀区',
      coords: [
        [116.329519, 39.972134],
        [116.408, 39.904],
      ],
    },
    {
      toName: '荣昌区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [105.594623, 29.405002],
      ],
    },
    {
      toName: '宜宾市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [104.643215, 28.751768],
      ],
    },
    {
      toName: '九江市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [116.00193, 29.705077],
      ],
    },
    {
      toName: '西安',
      fromName: '廊坊市',
      coords: [
        [116.683752, 39.538047],
        [108.969, 34.285],
      ],
    },
    {
      toName: '泸州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [105.442258, 28.871811],
      ],
    },
    {
      toName: '总部',
      fromName: '泰安市',
      coords: [
        [117.087614, 36.200252],
        [116.408, 39.904],
      ],
    },
    {
      toName: '济南市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.119999, 36.651216],
      ],
    },
    {
      toName: '沈阳',
      fromName: '大连市',
      coords: [
        [121.614682, 38.914003],
        [123.418, 41.799],
      ],
    },
    {
      toName: '大庆',
      fromName: '昭通市',
      coords: [
        [103.717465, 27.338257],
        [125.016, 46.593],
      ],
    },
    {
      toName: '商丘市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [115.65637, 34.414172],
      ],
    },
    {
      toName: '宜昌市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [111.286471, 30.691967],
      ],
    },
    {
      toName: '吉林',
      fromName: '黔江区',
      coords: [
        [108.770678, 29.53361],
        [125.324, 43.871],
      ],
    },
    {
      toName: '昆明市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [102.832891, 24.880095],
      ],
    },
    {
      toName: '西安',
      fromName: '锡林郭勒盟',
      coords: [
        [116.048222, 43.933454],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '舟山市',
      coords: [
        [122.207215, 29.985295],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '荆门市',
      coords: [
        [112.199265, 31.035423],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '哈密市',
      coords: [
        [93.514916, 42.818501],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吐鲁番市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [89.189651, 42.951382],
      ],
    },
    {
      toName: '漯河市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.016539, 33.581412],
      ],
    },
    {
      toName: '巴彦淖尔市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [107.387657, 40.743213],
      ],
    },
    {
      toName: '西安',
      fromName: '汉中市',
      coords: [
        [107.023323, 33.06748],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沧州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.838834, 38.304477],
      ],
    },
    {
      toName: '总部',
      fromName: '吕梁市',
      coords: [
        [111.144319, 37.518314],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '南通市',
      coords: [
        [120.894291, 31.980171],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '克拉玛依市',
      coords: [
        [84.889207, 45.579888],
        [116.408, 39.904],
      ],
    },
    {
      toName: '青岛市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.382639, 36.067082],
      ],
    },
    {
      toName: '总部',
      fromName: '伊犁哈萨克自治州',
      coords: [
        [81.324136, 43.916823],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '黄石市',
      coords: [
        [115.03852, 30.199652],
        [108.969, 34.285],
      ],
    },
    {
      toName: '揭阳市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.372831, 23.549993],
      ],
    },
    {
      toName: '总部',
      fromName: '西城区',
      coords: [
        [116.365868, 39.912289],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '昌平区',
      coords: [
        [116.231204, 40.22066],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '延边朝鲜族自治州',
      coords: [
        [129.508946, 42.891253],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '门头沟区',
      coords: [
        [116.102009, 39.940646],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '鄂尔多斯市',
      coords: [
        [109.781327, 39.608266],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '大理市',
      coords: [
        [100.267638, 25.606486],
        [125.016, 46.593],
      ],
    },
    {
      toName: '银川市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [106.230909, 38.487193],
      ],
    },
    {
      toName: '西安',
      fromName: '潮州市',
      coords: [
        [116.622603, 23.65695],
        [108.969, 34.285],
      ],
    },
    {
      toName: '鄂尔多斯市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [109.781327, 39.608266],
      ],
    },
    {
      toName: '西安',
      fromName: '梅州市',
      coords: [
        [116.122238, 24.288615],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '绵阳市',
      coords: [
        [104.679114, 31.46745],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '宁德市',
      coords: [
        [119.547932, 26.665617],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '廊坊市',
      coords: [
        [116.683752, 39.538047],
        [125.016, 46.593],
      ],
    },
    {
      toName: '盐城市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.163561, 33.347382],
      ],
    },
    {
      toName: '西安',
      fromName: '铜陵市',
      coords: [
        [117.812079, 30.945429],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '惠州市',
      coords: [
        [114.416196, 23.111847],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '淮安市',
      coords: [
        [119.015285, 33.610353],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '洛阳市',
      coords: [
        [112.45404, 34.619682],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '天津市河东区',
      coords: [
        [117.251587, 39.128291],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '大兴区',
      coords: [
        [116.341014, 39.784747],
        [116.408, 39.904],
      ],
    },
    {
      toName: '呼和浩特市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [111.74918, 40.842585],
      ],
    },
    {
      toName: '遂宁市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [105.592898, 30.532847],
      ],
    },
    {
      toName: '总部',
      fromName: '十堰市',
      coords: [
        [110.79799, 32.629397],
        [116.408, 39.904],
      ],
    },
    {
      toName: '涿州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [115.974422, 39.485283],
      ],
    },
    {
      toName: '吉林',
      fromName: '海西蒙古族藏族自治州',
      coords: [
        [97.369751, 37.377139],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '太原市',
      coords: [
        [112.548879, 37.87059],
        [108.969, 34.285],
      ],
    },
    {
      toName: '渝北区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.631187, 29.718143],
      ],
    },
    {
      toName: '辽源市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [125.143532, 42.887918],
      ],
    },
    {
      toName: '吉林',
      fromName: '浦东新区',
      coords: [
        [121.544379, 31.221517],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '芜湖市',
      coords: [
        [118.432941, 31.352859],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大渡口区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.482347, 29.484527],
      ],
    },
    {
      toName: '保定市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [115.464806, 38.873891],
      ],
    },
    {
      toName: '沈阳',
      fromName: '酒泉市',
      coords: [
        [98.494483, 39.73241],
        [123.418, 41.799],
      ],
    },
    {
      toName: '大庆',
      fromName: '丽江市',
      coords: [
        [100.22775, 26.855047],
        [125.016, 46.593],
      ],
    },
    {
      toName: '绍兴市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.580232, 30.029752],
      ],
    },
    {
      toName: '总部',
      fromName: '中卫市',
      coords: [
        [105.196902, 37.499972],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '成都市',
      coords: [
        [104.066541, 30.572269],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '杭州市',
      coords: [
        [120.15507, 30.274084],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '嘉峪关市',
      coords: [
        [98.289152, 39.77313],
        [108.969, 34.285],
      ],
    },
    {
      toName: '锡林郭勒盟',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.048222, 43.933454],
      ],
    },
    {
      toName: '总部',
      fromName: '运城市',
      coords: [
        [111.007528, 35.026412],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '百色市',
      coords: [
        [106.618201, 23.902333],
        [125.324, 43.871],
      ],
    },
    {
      toName: '沈阳',
      fromName: '青岛市',
      coords: [
        [120.382639, 36.067082],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '金华市',
      coords: [
        [119.647444, 29.079059],
        [108.969, 34.285],
      ],
    },
    {
      toName: '南京市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [118.796877, 32.060255],
      ],
    },
    {
      toName: '大庆',
      fromName: '玉林市',
      coords: [
        [110.164756, 22.636379],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '永州市',
      coords: [
        [111.613445, 26.420394],
        [108.969, 34.285],
      ],
    },
    {
      toName: '淮安市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.015285, 33.610353],
      ],
    },
    {
      toName: '大庆',
      fromName: '伊春市',
      coords: [
        [128.841147, 47.727536],
        [125.016, 46.593],
      ],
    },
    {
      toName: '河北区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.196648, 39.147869],
      ],
    },
    {
      toName: '沈阳',
      fromName: '赤峰市',
      coords: [
        [118.886856, 42.257817],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '随州市',
      coords: [
        [113.382458, 31.690215],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '喀什市',
      coords: [
        [75.989755, 39.4704],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '聊城市',
      coords: [
        [115.985371, 36.456703],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '长寿区',
      coords: [
        [107.081283, 29.857996],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '苏州市',
      coords: [
        [120.585315, 31.298886],
        [108.969, 34.285],
      ],
    },
    {
      toName: '阿勒泰市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [88.131842, 47.827309],
      ],
    },
    {
      toName: '西安',
      fromName: '陇南市',
      coords: [
        [104.921841, 33.400684],
        [108.969, 34.285],
      ],
    },
    {
      toName: '青岛市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [120.382639, 36.067082],
      ],
    },
    {
      toName: '总部',
      fromName: '克孜勒苏柯尔克孜自治州',
      coords: [
        [76.167819, 39.714526],
        [116.408, 39.904],
      ],
    },
    {
      toName: '三亚市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [109.511909, 18.252847],
      ],
    },
    {
      toName: '吉林',
      fromName: '永川区',
      coords: [
        [105.927376, 29.356117],
        [125.324, 43.871],
      ],
    },
    {
      toName: '渝中区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [106.568892, 29.55275],
      ],
    },
    {
      toName: '长沙市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.938814, 28.228209],
      ],
    },
    {
      toName: '顺义区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.654561, 40.130347],
      ],
    },
    {
      toName: '大庆',
      fromName: '红河哈尼族彝族自治州',
      coords: [
        [103.374799, 23.36313],
        [125.016, 46.593],
      ],
    },
    {
      toName: '东莞市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.751765, 23.020536],
      ],
    },
    {
      toName: '南昌市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [115.858197, 28.682892],
      ],
    },
    {
      toName: '总部',
      fromName: '海口市',
      coords: [
        [110.198293, 20.044001],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大兴安岭地区',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [124.71108, 52.335206],
      ],
    },
    {
      toName: '枣庄市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.323725, 34.810487],
      ],
    },
    {
      toName: '兰州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [103.834303, 36.061089],
      ],
    },
    {
      toName: '总部',
      fromName: '淄博市',
      coords: [
        [118.054927, 36.813487],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '长沙市',
      coords: [
        [112.938814, 28.228209],
        [116.408, 39.904],
      ],
    },
    {
      toName: '盐城市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.163561, 33.347382],
      ],
    },
    {
      toName: '西安',
      fromName: '嘉兴市',
      coords: [
        [120.755486, 30.746129],
        [108.969, 34.285],
      ],
    },
    {
      toName: '克拉玛依市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [84.889207, 45.579888],
      ],
    },
    {
      toName: '宿迁市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.275198, 33.963232],
      ],
    },
    {
      toName: '昆明市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [102.832891, 24.880095],
      ],
    },
    {
      toName: '贵阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.630153, 26.647661],
      ],
    },
    {
      toName: '昌平区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.231204, 40.22066],
      ],
    },
    {
      toName: '临泉县',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [115.261473, 33.040261],
      ],
    },
    {
      toName: '芜湖市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.432941, 31.352859],
      ],
    },
    {
      toName: '西安',
      fromName: '益阳市',
      coords: [
        [112.35518, 28.55386],
        [108.969, 34.285],
      ],
    },
    {
      toName: '盘锦市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [122.070714, 41.119997],
      ],
    },
    {
      toName: '总部',
      fromName: '仙桃市',
      coords: [
        [113.453974, 30.364953],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '巩义市',
      coords: [
        [113.022497, 34.747834],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '晋城市',
      coords: [
        [112.851831, 35.490701],
        [116.408, 39.904],
      ],
    },
    {
      toName: '运城市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [111.007528, 35.026412],
      ],
    },
    {
      toName: '大庆',
      fromName: '莆田市',
      coords: [
        [119.007777, 25.454084],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '赣州市',
      coords: [
        [114.935029, 25.831829],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '河源市',
      coords: [
        [114.700447, 23.743538],
        [108.969, 34.285],
      ],
    },
    {
      toName: '乌鲁木齐市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [87.616848, 43.825592],
      ],
    },
    {
      toName: '总部',
      fromName: '阿拉善盟',
      coords: [
        [105.728969, 38.851892],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '株洲市',
      coords: [
        [113.134002, 27.82755],
        [108.969, 34.285],
      ],
    },
    {
      toName: '任丘市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.082918, 38.683592],
      ],
    },
    {
      toName: '西安',
      fromName: '孝感市',
      coords: [
        [113.916902, 30.924568],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '梧州市',
      coords: [
        [111.279115, 23.476962],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '吐鲁番市',
      coords: [
        [89.189651, 42.951382],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '巴彦淖尔市',
      coords: [
        [107.387657, 40.743213],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '泉州市',
      coords: [
        [118.675675, 24.874132],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '浦东新区',
      coords: [
        [121.544379, 31.221517],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '保山市',
      coords: [
        [99.161761, 25.112046],
        [125.016, 46.593],
      ],
    },
    {
      toName: '衡阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.571997, 26.89323],
      ],
    },
    {
      toName: '海口市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [110.198293, 20.044001],
      ],
    },
    {
      toName: '绥化市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [126.968887, 46.653845],
      ],
    },
    {
      toName: '吉林',
      fromName: '遂宁市',
      coords: [
        [105.592898, 30.532847],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [125.103784, 46.589309],
      ],
    },
    {
      toName: '大同市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.300129, 40.076762],
      ],
    },
    {
      toName: '总部',
      fromName: '阿勒泰市',
      coords: [
        [88.131842, 47.827309],
        [116.408, 39.904],
      ],
    },
    {
      toName: '津南区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [117.391976, 38.984526],
      ],
    },
    {
      toName: '仙桃市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.453974, 30.364953],
      ],
    },
    {
      toName: '总部',
      fromName: '德州市',
      coords: [
        [116.357464, 37.434092],
        [116.408, 39.904],
      ],
    },
    {
      toName: '淄博市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [118.054927, 36.813487],
      ],
    },
    {
      toName: '总部',
      fromName: '庆阳市',
      coords: [
        [107.643631, 35.709077],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '常德市',
      coords: [
        [111.698497, 29.031673],
        [116.408, 39.904],
      ],
    },
    {
      toName: '包头市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [109.840347, 40.657449],
      ],
    },
    {
      toName: '总部',
      fromName: '东营市',
      coords: [
        [118.674767, 37.434751],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '西宁市',
      coords: [
        [101.778228, 36.617144],
        [108.969, 34.285],
      ],
    },
    {
      toName: '陇南市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [104.921841, 33.400684],
      ],
    },
    {
      toName: '西安',
      fromName: '连云港市',
      coords: [
        [119.221611, 34.596653],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '双鸭山市',
      coords: [
        [131.159133, 46.646508],
        [125.016, 46.593],
      ],
    },
    {
      toName: '南通市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.894291, 31.980171],
      ],
    },
    {
      toName: '金华市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.647444, 29.079059],
      ],
    },
    {
      toName: '吉林',
      fromName: '上饶市',
      coords: [
        [117.943433, 28.454863],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '许昌市',
      coords: [
        [113.85264, 34.035506],
        [116.408, 39.904],
      ],
    },
    {
      toName: '成都市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [104.066541, 30.572269],
      ],
    },
    {
      toName: '汕头市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.681972, 23.354091],
      ],
    },
    {
      toName: '涪陵区',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [107.389298, 29.703113],
      ],
    },
    {
      toName: '总部',
      fromName: '密云区',
      coords: [
        [116.843177, 40.376834],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '武汉市',
      coords: [
        [114.305392, 30.593098],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '衢州市',
      coords: [
        [118.859457, 28.970079],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '南京市',
      coords: [
        [118.796877, 32.060255],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '深圳市',
      coords: [
        [114.057868, 22.543099],
        [116.408, 39.904],
      ],
    },
    {
      toName: '双鸭山市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [131.159133, 46.646508],
      ],
    },
    {
      toName: '总部',
      fromName: '合肥市',
      coords: [
        [117.227239, 31.820586],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '安康市',
      coords: [
        [109.029022, 32.684714],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '廊坊市',
      coords: [
        [116.683752, 39.538047],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '湘潭市',
      coords: [
        [112.944049, 27.829738],
        [108.969, 34.285],
      ],
    },
    {
      toName: '滨海新区',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [117.78067, 39.246083],
      ],
    },
    {
      toName: '克拉玛依市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [84.889207, 45.579888],
      ],
    },
    {
      toName: '吉林',
      fromName: '绵阳市',
      coords: [
        [104.679114, 31.46745],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '滨州市',
      coords: [
        [117.970703, 37.38199],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '广州市',
      coords: [
        [113.264434, 23.129162],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '驻马店市',
      coords: [
        [114.022298, 33.011529],
        [125.324, 43.871],
      ],
    },
    {
      toName: '兴安盟',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [122.067042, 46.077561],
      ],
    },
    {
      toName: '茂名市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [110.925456, 21.662999],
      ],
    },
    {
      toName: '西安',
      fromName: '湖州市',
      coords: [
        [120.086823, 30.894348],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '海西蒙古族藏族自治州',
      coords: [
        [97.369751, 37.377139],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '文昌市',
      coords: [
        [110.797717, 19.543422],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '绥化市',
      coords: [
        [126.968887, 46.653845],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '淮安市',
      coords: [
        [119.015285, 33.610353],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '澄迈县',
      coords: [
        [110.006755, 19.738521],
        [125.016, 46.593],
      ],
    },
    {
      toName: '广州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.264434, 23.129162],
      ],
    },
    {
      toName: '宁波市江北区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [121.555227, 29.886757],
      ],
    },
    {
      toName: '广州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.264434, 23.129162],
      ],
    },
    {
      toName: '中卫市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [105.196902, 37.499972],
      ],
    },
    {
      toName: '总部',
      fromName: '霸州市',
      coords: [
        [116.391386, 39.125898],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '六安市',
      coords: [
        [116.521854, 31.733699],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '焦作市',
      coords: [
        [113.241823, 35.215892],
        [116.408, 39.904],
      ],
    },
    {
      toName: '淮安市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [119.015285, 33.610353],
      ],
    },
    {
      toName: '西安',
      fromName: '江门市',
      coords: [
        [113.081901, 22.578738],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '任丘市',
      coords: [
        [116.082918, 38.683592],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '滨海新区',
      coords: [
        [117.78067, 39.246083],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '丽水市',
      coords: [
        [119.922796, 28.46763],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '石嘴山市',
      coords: [
        [106.383303, 38.983236],
        [123.418, 41.799],
      ],
    },
    {
      toName: '总部',
      fromName: '信阳市',
      coords: [
        [114.091023, 32.146983],
        [116.408, 39.904],
      ],
    },
    {
      toName: '清远市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.056031, 23.681763],
      ],
    },
    {
      toName: '十堰市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [110.79799, 32.629397],
      ],
    },
    {
      toName: '西安',
      fromName: '北京市朝阳区',
      coords: [
        [116.601144, 39.948574],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '湛江市',
      coords: [
        [110.359377, 21.270707],
        [108.969, 34.285],
      ],
    },
    {
      toName: '葫芦岛市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [120.836932, 40.711052],
      ],
    },
    {
      toName: '吉林',
      fromName: '徐州市',
      coords: [
        [117.284124, 34.205768],
        [125.324, 43.871],
      ],
    },
    {
      toName: '嘉兴市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.755486, 30.746129],
      ],
    },
    {
      toName: '西安',
      fromName: '池州市',
      coords: [
        [117.491568, 30.6648],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '恩施市',
      coords: [
        [109.488172, 30.272156],
        [116.408, 39.904],
      ],
    },
    {
      toName: '珠海市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.576726, 22.270715],
      ],
    },
    {
      toName: '吉林',
      fromName: '海南区',
      coords: [
        [106.891424, 39.441364],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '温州市',
      coords: [
        [120.699366, 27.994267],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '潍坊市',
      coords: [
        [119.161755, 36.706774],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '石河子市',
      coords: [
        [86.08046, 44.305428],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '衡阳市',
      coords: [
        [112.571997, 26.89323],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西宁市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [101.778228, 36.617144],
      ],
    },
    {
      toName: '总部',
      fromName: '徐州市',
      coords: [
        [117.284124, 34.205768],
        [116.408, 39.904],
      ],
    },
    {
      toName: '菏泽市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [115.480656, 35.23375],
      ],
    },
    {
      toName: '总部',
      fromName: '秦皇岛市',
      coords: [
        [119.600492, 39.935385],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '昆明市',
      coords: [
        [102.832891, 24.880095],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '眉山市',
      coords: [
        [103.848538, 30.075439],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '大兴安岭地区',
      coords: [
        [124.71108, 52.335206],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '昆山市',
      coords: [
        [120.980737, 31.385598],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '乐山市',
      coords: [
        [103.765568, 29.552106],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '周口市',
      coords: [
        [114.696951, 33.626149],
        [116.408, 39.904],
      ],
    },
    {
      toName: '平凉市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.66524, 35.543051],
      ],
    },
    {
      toName: '西安',
      fromName: '宣城市',
      coords: [
        [118.758816, 30.940718],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '广安市',
      coords: [
        [106.633212, 30.455961],
        [125.324, 43.871],
      ],
    },
    {
      toName: '宣城市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.758816, 30.940718],
      ],
    },
    {
      toName: '西安',
      fromName: '延安市',
      coords: [
        [109.489727, 36.585455],
        [108.969, 34.285],
      ],
    },
    {
      toName: '梅州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.122238, 24.288615],
      ],
    },
    {
      toName: '大庆',
      fromName: '西双版纳傣族自治州',
      coords: [
        [100.797777, 22.007351],
        [125.016, 46.593],
      ],
    },
    {
      toName: '马鞍山市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.506759, 31.670452],
      ],
    },
    {
      toName: '西安',
      fromName: '兴安盟',
      coords: [
        [122.067042, 46.077561],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '阿克苏市',
      coords: [
        [80.260605, 41.168779],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '厦门市',
      coords: [
        [118.089425, 24.479833],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '贵阳市',
      coords: [
        [106.630153, 26.647661],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '开封市',
      coords: [
        [114.307581, 34.797239],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '达州市',
      coords: [
        [107.468023, 31.209571],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '天水市',
      coords: [
        [105.724947, 34.580863],
        [108.969, 34.285],
      ],
    },
    {
      toName: '娄底市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [111.993497, 27.700062],
      ],
    },
    {
      toName: '抚州市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [116.358181, 27.949217],
      ],
    },
    {
      toName: '衢州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [118.859457, 28.970079],
      ],
    },
    {
      toName: '总部',
      fromName: '邯郸市',
      coords: [
        [114.538961, 36.625657],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '枣庄市',
      coords: [
        [117.323725, 34.810487],
        [123.418, 41.799],
      ],
    },
    {
      toName: '云浮市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.044491, 22.915094],
      ],
    },
    {
      toName: '揭阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.372831, 23.549993],
      ],
    },
    {
      toName: '总部',
      fromName: '绍兴市',
      coords: [
        [120.580232, 30.029752],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '柳州市',
      coords: [
        [109.415953, 24.325502],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '四平市',
      coords: [
        [124.350398, 43.166419],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '十堰市',
      coords: [
        [110.79799, 32.629397],
        [125.324, 43.871],
      ],
    },
    {
      toName: '成都市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [104.066541, 30.572269],
      ],
    },
    {
      toName: '西安',
      fromName: '宜昌市',
      coords: [
        [111.286471, 30.691967],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '扬州市',
      coords: [
        [119.412966, 32.39421],
        [125.324, 43.871],
      ],
    },
    {
      toName: '楚雄市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [101.528068, 25.045532],
      ],
    },
    {
      toName: '沈阳',
      fromName: '铁岭市',
      coords: [
        [123.726166, 42.223769],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '荆州市',
      coords: [
        [112.239741, 30.335165],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '银川市',
      coords: [
        [106.230909, 38.487193],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大庆',
      fromName: '崇左市',
      coords: [
        [107.364711, 22.376532],
        [125.016, 46.593],
      ],
    },
    {
      toName: '大理市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [100.267638, 25.606486],
      ],
    },
    {
      toName: '三亚市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [109.511909, 18.252847],
      ],
    },
    {
      toName: '西安',
      fromName: '娄底市',
      coords: [
        [111.993497, 27.700062],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '哈尔滨市',
      coords: [
        [126.534967, 45.803775],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '阿坝藏族羌族自治州',
      coords: [
        [102.224653, 31.899413],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '阜阳市',
      coords: [
        [115.814204, 32.890124],
        [108.969, 34.285],
      ],
    },
    {
      toName: '扬州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.412966, 32.39421],
      ],
    },
    {
      toName: '通辽市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [122.243444, 43.65289],
      ],
    },
    {
      toName: '阿克苏市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [80.260605, 41.168779],
      ],
    },
    {
      toName: '无锡市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.31191, 31.491169],
      ],
    },
    {
      toName: '庆阳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [107.643631, 35.709077],
      ],
    },
    {
      toName: '西安',
      fromName: '泰州市',
      coords: [
        [119.923116, 32.455778],
        [108.969, 34.285],
      ],
    },
    {
      toName: '黔东南苗族侗族自治州',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [107.982859, 26.583442],
      ],
    },
    {
      toName: '大庆',
      fromName: '黔东南苗族侗族自治州',
      coords: [
        [107.982859, 26.583442],
        [125.016, 46.593],
      ],
    },
    {
      toName: '西安',
      fromName: '南通市',
      coords: [
        [120.894291, 31.980171],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '拉萨市',
      coords: [
        [91.140856, 29.645554],
        [108.969, 34.285],
      ],
    },
    {
      toName: '揭阳市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [116.372831, 23.549993],
      ],
    },
    {
      toName: '吉林',
      fromName: '资阳市',
      coords: [
        [104.627636, 30.128901],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '牡丹江市',
      coords: [
        [129.633168, 44.551653],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '三亚市',
      coords: [
        [109.511909, 18.252847],
        [116.408, 39.904],
      ],
    },
    {
      toName: '清远市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [113.056031, 23.681763],
      ],
    },
    {
      toName: '西安',
      fromName: '宿迁市',
      coords: [
        [118.275198, 33.963232],
        [108.969, 34.285],
      ],
    },
    {
      toName: '鹰潭市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [117.069202, 28.260189],
      ],
    },
    {
      toName: '恩施市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [109.488172, 30.272156],
      ],
    },
    {
      toName: '大庆',
      fromName: '珠海市',
      coords: [
        [113.576726, 22.270715],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '吐鲁番市',
      coords: [
        [89.189651, 42.951382],
        [116.408, 39.904],
      ],
    },
    {
      toName: '深圳市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [114.057868, 22.543099],
      ],
    },
    {
      toName: '大庆',
      fromName: '漳州市',
      coords: [
        [117.647481, 24.512948],
        [125.016, 46.593],
      ],
    },
    {
      toName: '沈阳',
      fromName: '鞍山市',
      coords: [
        [122.994329, 41.108647],
        [123.418, 41.799],
      ],
    },
    {
      toName: '泸州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [105.442258, 28.871811],
      ],
    },
    {
      toName: '合肥市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [117.227239, 31.820586],
      ],
    },
    {
      toName: '西安',
      fromName: '铜川市',
      coords: [
        [108.945233, 34.896756],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '海北藏族自治州',
      coords: [
        [100.900997, 36.954413],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '台州市',
      coords: [
        [121.420757, 28.656386],
        [108.969, 34.285],
      ],
    },
    {
      toName: '吉林',
      fromName: '德阳市',
      coords: [
        [104.397894, 31.126855],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林',
      fromName: '株洲市',
      coords: [
        [113.134002, 27.82755],
        [125.324, 43.871],
      ],
    },
    {
      toName: '大庆',
      fromName: '遵义市',
      coords: [
        [106.927389, 27.725654],
        [125.016, 46.593],
      ],
    },
    {
      toName: '七台河市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [131.003138, 45.771726],
      ],
    },
    {
      toName: '福州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.296494, 26.074507],
      ],
    },
    {
      toName: '朔州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [112.432825, 39.331595],
      ],
    },
    {
      toName: '西安',
      fromName: '中山市',
      coords: [
        [113.392782, 22.517645],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '西安市',
      coords: [
        [108.940174, 34.341568],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '德宏傣族景颇族自治州',
      coords: [
        [98.584895, 24.433353],
        [125.016, 46.593],
      ],
    },
    {
      toName: '阿坝藏族羌族自治州',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [102.224653, 31.899413],
      ],
    },
    {
      toName: '大连市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [121.614682, 38.914003],
      ],
    },
    {
      toName: '吉林',
      fromName: '南充市',
      coords: [
        [106.110698, 30.837793],
        [125.324, 43.871],
      ],
    },
    {
      toName: '淮安市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [119.015285, 33.610353],
      ],
    },
    {
      toName: '吉林',
      fromName: '合肥市',
      coords: [
        [117.227239, 31.820586],
        [125.324, 43.871],
      ],
    },
    {
      toName: '兰州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [103.834303, 36.061089],
      ],
    },
    {
      toName: '西安',
      fromName: '蚌埠市',
      coords: [
        [117.389719, 32.916287],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '保定市',
      coords: [
        [115.464806, 38.873891],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '昆明市',
      coords: [
        [102.832891, 24.880095],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '黄冈市',
      coords: [
        [114.872316, 30.453905],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '佛山市',
      coords: [
        [113.121416, 23.021548],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '孝感市',
      coords: [
        [113.916902, 30.924568],
        [125.324, 43.871],
      ],
    },
    {
      toName: '咸宁市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.322492, 29.841443],
      ],
    },
    {
      toName: '西安',
      fromName: '安庆市',
      coords: [
        [117.063754, 30.543494],
        [108.969, 34.285],
      ],
    },
    {
      toName: '西安',
      fromName: '呼和浩特市',
      coords: [
        [111.74918, 40.842585],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '黔西南布依族苗族自治州',
      coords: [
        [104.906396, 25.087825],
        [125.016, 46.593],
      ],
    },
    {
      toName: '郑州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [113.625368, 34.746599],
      ],
    },
    {
      toName: '吉林',
      fromName: '连云港市',
      coords: [
        [119.221611, 34.596653],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '怀化市',
      coords: [
        [109.998488, 27.554978],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '濮阳市',
      coords: [
        [115.029215, 35.761829],
        [116.408, 39.904],
      ],
    },
    {
      toName: '邯郸市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [114.538961, 36.625657],
      ],
    },
    {
      toName: '西安',
      fromName: '岳阳市',
      coords: [
        [113.128958, 29.357104],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '宝鸡市',
      coords: [
        [107.237974, 34.361979],
        [116.408, 39.904],
      ],
    },
    {
      toName: '肇庆市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [112.465091, 23.047191],
      ],
    },
    {
      toName: '西安',
      fromName: '榆林市',
      coords: [
        [109.734589, 38.28539],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '任丘市',
      coords: [
        [116.082918, 38.683592],
        [123.418, 41.799],
      ],
    },
    {
      toName: '海西蒙古族藏族自治州',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [97.369751, 37.377139],
      ],
    },
    {
      toName: '吉林',
      fromName: '通化市',
      coords: [
        [125.939697, 41.728401],
        [125.324, 43.871],
      ],
    },
    {
      toName: '银川市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [106.230909, 38.487193],
      ],
    },
    {
      toName: '西安',
      fromName: '清远市',
      coords: [
        [113.056031, 23.681763],
        [108.969, 34.285],
      ],
    },
    {
      toName: '海口市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [110.198293, 20.044001],
      ],
    },
    {
      toName: '西安',
      fromName: '张掖市',
      coords: [
        [100.449818, 38.925875],
        [108.969, 34.285],
      ],
    },
    {
      toName: '南宁市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [108.366543, 22.817002],
      ],
    },
    {
      toName: '总部',
      fromName: '东城区',
      coords: [
        [116.416357, 39.928353],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '成都市',
      coords: [
        [104.066541, 30.572269],
        [108.969, 34.285],
      ],
    },
    {
      toName: '盐城市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [120.163561, 33.347382],
      ],
    },
    {
      toName: '总部',
      fromName: '南宁市',
      coords: [
        [108.366543, 22.817002],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '吴忠市',
      coords: [
        [106.198393, 37.99746],
        [123.418, 41.799],
      ],
    },
    {
      toName: '佛山市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [113.121416, 23.021548],
      ],
    },
    {
      toName: '潮州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.622603, 23.65695],
      ],
    },
    {
      toName: '大庆',
      fromName: '拉萨市',
      coords: [
        [91.140856, 29.645554],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '扬州市',
      coords: [
        [119.412966, 32.39421],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '万州区',
      coords: [
        [108.408661, 30.807667],
        [125.324, 43.871],
      ],
    },
    {
      toName: '总部',
      fromName: '临沂市',
      coords: [
        [118.356448, 35.104672],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '安顺市',
      coords: [
        [105.947593, 26.253072],
        [125.324, 43.871],
      ],
    },
    {
      toName: '温州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.699366, 27.994267],
      ],
    },
    {
      toName: '总部',
      fromName: '和田市',
      coords: [
        [79.913534, 37.112149],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '黄南藏族自治州',
      coords: [
        [102.015248, 35.519548],
        [125.324, 43.871],
      ],
    },
    {
      toName: '吉林市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [126.549576, 43.837883],
      ],
    },
    {
      toName: '西安',
      fromName: '塔城市',
      coords: [
        [82.978928, 46.748523],
        [108.969, 34.285],
      ],
    },
    {
      toName: '昆明市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [102.832891, 24.880095],
      ],
    },
    {
      toName: '西安',
      fromName: '盐城市',
      coords: [
        [120.163561, 33.347382],
        [108.969, 34.285],
      ],
    },
    {
      toName: '沈阳',
      fromName: '呼和浩特市',
      coords: [
        [111.74918, 40.842585],
        [123.418, 41.799],
      ],
    },
    {
      toName: '白银市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [104.138559, 36.544756],
      ],
    },
    {
      toName: '徐州市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [117.284124, 34.205768],
      ],
    },
    {
      toName: '酒泉市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [98.494483, 39.73241],
      ],
    },
    {
      toName: '西安',
      fromName: '珠海市',
      coords: [
        [113.576726, 22.270715],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '常州市',
      coords: [
        [119.973987, 31.810689],
        [116.408, 39.904],
      ],
    },
    {
      toName: '苏州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [120.585315, 31.298886],
      ],
    },
    {
      toName: '长春市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [125.323544, 43.817071],
      ],
    },
    {
      toName: '吉林',
      fromName: '吉安市',
      coords: [
        [114.992509, 27.113443],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '宿州市',
      coords: [
        [116.964356, 33.646373],
        [108.969, 34.285],
      ],
    },
    {
      toName: '徐州市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [117.284124, 34.205768],
      ],
    },
    {
      toName: '西安',
      fromName: '乌鲁木齐市',
      coords: [
        [87.616848, 43.825592],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '福州市',
      coords: [
        [119.296494, 26.074507],
        [125.016, 46.593],
      ],
    },
    {
      toName: '总部',
      fromName: '承德市',
      coords: [
        [117.96241, 40.954071],
        [116.408, 39.904],
      ],
    },
    {
      toName: '西安',
      fromName: '淮北市',
      coords: [
        [116.798265, 33.955844],
        [108.969, 34.285],
      ],
    },
    {
      toName: '霸州市',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [116.391386, 39.125898],
      ],
    },
    {
      toName: '沈阳',
      fromName: '泰安市',
      coords: [
        [117.087614, 36.200252],
        [123.418, 41.799],
      ],
    },
    {
      toName: '泉州市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [118.675675, 24.874132],
      ],
    },
    {
      toName: '西安',
      fromName: '咸宁市',
      coords: [
        [114.322492, 29.841443],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '酒泉市',
      coords: [
        [98.494483, 39.73241],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大渡口区',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [106.482347, 29.484527],
      ],
    },
    {
      toName: '吉林',
      fromName: '铜仁市',
      coords: [
        [109.189598, 27.731514],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '定西市',
      coords: [
        [104.626282, 35.580662],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '张家口市',
      coords: [
        [114.887543, 40.824418],
        [116.408, 39.904],
      ],
    },
    {
      toName: '大庆',
      fromName: '苏州市',
      coords: [
        [120.585315, 31.298886],
        [125.016, 46.593],
      ],
    },
    {
      toName: '吉林',
      fromName: '抚州市',
      coords: [
        [116.358181, 27.949217],
        [125.324, 43.871],
      ],
    },
    {
      toName: '西安',
      fromName: '乌兰察布市',
      coords: [
        [113.132585, 40.994785],
        [108.969, 34.285],
      ],
    },
    {
      toName: '锡林郭勒盟',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [116.048222, 43.933454],
      ],
    },
    {
      toName: '临夏市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [103.210538, 35.601182],
      ],
    },
    {
      toName: '阳江市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [111.982232, 21.857958],
      ],
    },
    {
      toName: '吉林',
      fromName: '海东市',
      coords: [
        [102.104287, 36.502039],
        [125.324, 43.871],
      ],
    },
    {
      toName: '沈阳',
      fromName: '济南市',
      coords: [
        [117.119999, 36.651216],
        [123.418, 41.799],
      ],
    },
    {
      toName: '松原市',
      fromName: '大庆',
      coords: [
        [125.016, 46.593],
        [124.825117, 45.141789],
      ],
    },
    {
      toName: '总部',
      fromName: '揭阳市',
      coords: [
        [116.372831, 23.549993],
        [116.408, 39.904],
      ],
    },
    {
      toName: '营口市',
      fromName: '沈阳',
      coords: [
        [123.418, 41.799],
        [122.235417, 40.667012],
      ],
    },
    {
      toName: '渝中区',
      fromName: '总部',
      coords: [
        [116.408, 39.904],
        [106.568892, 29.55275],
      ],
    },
    {
      toName: '沈阳',
      fromName: '固原市',
      coords: [
        [106.24261, 36.015855],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '银川市',
      coords: [
        [106.230909, 38.487193],
        [108.969, 34.285],
      ],
    },
    {
      toName: '总部',
      fromName: '沧州市',
      coords: [
        [116.838834, 38.304477],
        [116.408, 39.904],
      ],
    },
    {
      toName: '总部',
      fromName: '兰州市',
      coords: [
        [103.834303, 36.061089],
        [116.408, 39.904],
      ],
    },
    {
      toName: '吉林',
      fromName: '内江市',
      coords: [
        [105.058433, 29.580228],
        [125.324, 43.871],
      ],
    },
    {
      toName: '呼伦贝尔市',
      fromName: '西安',
      coords: [
        [108.969, 34.285],
        [119.765744, 49.211574],
      ],
    },
    {
      toName: '西安',
      fromName: '渝北区',
      coords: [
        [106.631187, 29.718143],
        [108.969, 34.285],
      ],
    },
    {
      toName: '柳州市',
      fromName: '吉林',
      coords: [
        [125.324, 43.871],
        [109.415953, 24.325502],
      ],
    },
    {
      toName: '沈阳',
      fromName: '奉贤区',
      coords: [
        [121.474042, 30.917795],
        [123.418, 41.799],
      ],
    },
    {
      toName: '总部',
      fromName: '博尔塔拉蒙古自治州',
      coords: [
        [82.066159, 44.905588],
        [116.408, 39.904],
      ],
    },
    {
      toName: '沈阳',
      fromName: '锦州市',
      coords: [
        [121.127003, 41.095119],
        [123.418, 41.799],
      ],
    },
    {
      toName: '西安',
      fromName: '遂宁市',
      coords: [
        [105.592898, 30.532847],
        [108.969, 34.285],
      ],
    },
    {
      toName: '大庆',
      fromName: '河池市',
      coords: [
        [108.085261, 24.692931],
        [125.016, 46.593],
      ],
    },
    // {
    //   toName: '汉中市',
    //   fromName: '西安',
    //   coords: [
    //     [108.969, 34.285],
    //     [107.023323, 33.06748],
    //   ],
    // },
    // {
    //   toName: '沈阳',
    //   fromName: '辽阳市',
    //   coords: [
    //     [123.236944, 41.267244],
    //     [123.418, 41.799],
    //   ],
    // },
  ]

  const [lines,setlines] = useState(moveLines)


  useEffect(()=>{
    const t = setInterval(()=>{
       setlines(moveLines.slice(0,100))
    },2000)
  },[])


  return ( <div>
    <MapChart
            allData={{
              citys: [
                {
                  name: '总部',
                  value: [116.408, 39.904, -19],
                  symbolSize: 14,
                  itemStyle: { normal: { color: '#58B3CC' } },
                },
                {
                  name: '大庆',
                  value: [125.016, 46.593, -19],
                  symbolSize: 4,
                  itemStyle: { normal: { color: '#58B3CC' } },
                },
                {
                  name: '沈阳',
                  value: [123.418, 41.799, -19],
                  symbolSize: 2,
                  itemStyle: { normal: { color: '#58B3CC' } },
                },
                {
                  name: '吉林',
                  value: [125.324, 43.871, -19],
                  symbolSize: 2,
                  itemStyle: { normal: { color: '#58B3CC' } },
                },
                {
                  name: '西安',
                  value: [108.969, 34.285, -19],
                  symbolSize: 4,
                  itemStyle: { normal: { color: '#58B3CC' } },
                },
              ],
              moveLines: lines,
            }}
          />
  </div>
  );
}
